wajmh/Code/Firmware/GD32F50x_Firmware_Library/Firmware/GD32F50x_standard_peripheral/Include/gd32f50x_fmc.h
/*!
    \file    gd32f50x_fmc.h
    \brief   definitions for the FMC

    \version 2025-11-10, V1.01, firmware for GD32F50x
*/

/*
    Copyright (c) 2025, GigaDevice Semiconductor Inc.

    Redistribution and use in source and binary forms, with or without modification,
are permitted provided that the following conditions are met:

    1. Redistributions of source code must retain the above copyright notice, this
       list of conditions and the following disclaimer.
    2. Redistributions in binary form must reproduce the above copyright notice,
       this list of conditions and the following disclaimer in the documentation
       and/or other materials provided with the distribution.
    3. Neither the name of the copyright holder nor the names of its contributors
       may be used to endorse or promote products derived from this software without
       specific prior written permission.

    THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT,
INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR
PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY
OF SUCH DAMAGE.
*/


#ifndef GD32F50X_FMC_H
#define GD32F50X_FMC_H

#include "gd32f50x.h"

/* FMC and option byte definition */
#define FMC                            FMC_BASE                                      /*!< FMC register base address */
#define OB                             OB_BASE                                       /*!< option bytes base address */

/* registers definitions */
#define FMC_KEY0                       REG32((FMC) + 0x04U)                          /*!< FMC unlock key register 0 */
#define FMC_OBKEY                      REG32((FMC) + 0x08U)                          /*!< FMC option bytes unlock key register */
#define FMC_STAT0                      REG32((FMC) + 0x0CU)                          /*!< FMC status register 0 */
#define FMC_CTL0                       REG32((FMC) + 0x10U)                          /*!< FMC control register 0 */
#define FMC_ADDR0                      REG32((FMC) + 0x14U)                          /*!< FMC address register 0 */
#define FMC_OBCTL0                     REG32((FMC) + 0x18U)                          /*!< FMC option byte control register 0 */
#define FMC_OBCTL1                     REG32((FMC) + 0x1CU)                          /*!< FMC option byte control register 1 */
#define FMC_OBCTL2                     REG32((FMC) + 0x20U)                          /*!< FMC option byte control register 2 */
#define FMC_OTP1CFG                    REG32((FMC) + 0x24U)                          /*!< FMC OTP1 configuration register */
#define FMC_OBSTAT                     REG32((FMC) + 0x40U)                          /*!< FMC option bytes status register */
#define FMC_KEY1                       REG32((FMC) + 0x44U)                          /*!< FMC unlock key register 1 */
#define FMC_STAT1                      REG32((FMC) + 0x4CU)                          /*!< FMC status register 1 */
#define FMC_CTL1                       REG32((FMC) + 0x50U)                          /*!< FMC control register 1 */
#define FMC_ADDR1                      REG32((FMC) + 0x54U)                          /*!< FMC address register 1 */
#define FMC_OTP3_STAT                  REG32((FMC) + 0x60U)                          /*!< FMC OTP3 status register */
#define FMC_PID                        REG32((FMC) + 0x100U)                         /*!< FMC product ID register */

#define OB_SPC                         REG16((OB) + 0x00U)                           /*!< option byte security protection value */
#define OB_USER                        REG16((OB) + 0x02U)                           /*!< option byte user value */
#define OB_DATA_0                      REG16((OB) + 0x04U)                           /*!< option byte data0 value */
#define OB_DATA_1                      REG16((OB) + 0x06U)                           /*!< option byte data1 value */
#define OB_WP0                         REG16((OB) + 0x08U)                           /*!< option byte write protection 0 */
#define OB_WP1                         REG16((OB) + 0x0AU)                           /*!< option byte write protection 1 */
#define OB_WP2                         REG16((OB) + 0x0CU)                           /*!< option byte write protection 2 */
#define OB_WP3                         REG16((OB) + 0x0EU)                           /*!< option byte write protection 3 */

/* bits definitions */
/* FMC_KEY0 */
#define FMC_KEY0_KEY                   BITS(0,31)                                    /*!< FMC_CTL0 unlock key bits */

/* FMC_OBKEY */
#define FMC_OBKEY_OBKEY                BITS(0,31)                                    /*!< option bytes unlock key bits */

/* FMC_STAT0 */
#define FMC_STAT0_BUSY                 BIT(0)                                        /*!< flash busy flag bit */
#define FMC_STAT0_PGERR                BIT(2)                                        /*!< flash program error flag bit */
#define FMC_STAT0_WPERR                BIT(4)                                        /*!< erase/program protection error flag bit */
#define FMC_STAT0_ENDF                 BIT(5)                                        /*!< end of operation flag bit */

/* FMC_CTL0 */
#define FMC_CTL0_PG                    BIT(0)                                        /*!< main flash program for bank0 command bit */
#define FMC_CTL0_PER                   BIT(1)                                        /*!< main flash page erase for bank0 command bit */
#define FMC_CTL0_MER                   BIT(2)                                        /*!< main flash mass erase for bank0 command bit */
#define FMC_CTL0_START                 BIT(6)                                        /*!< send erase command to FMC bit */
#define FMC_CTL0_LK                    BIT(7)                                        /*!< FMC_CTL0 lock bit */
#define FMC_CTL0_ERRIE                 BIT(10)                                       /*!< error interrupt enable bit */
#define FMC_CTL0_ENDIE                 BIT(12)                                       /*!< end of operation interrupt enable bit */
#define FMC_CTL0_RLBE                  BIT(13)                                       /*!< OTP2 read lock block enable bit */
#define FMC_CTL0_PWDN                  BIT(30)                                       /*!< deep power down mode enable when no operation */
#define FMC_CTL0_NWLDE                 BIT(31)                                       /*!< no waiting time area load enable when system reset */

/* FMC_ADDR0 */
#define FMC_ADDR0_ADDR                 BITS(0,31)                                    /*!< Flash erase/program command address bits */

/* FMC_OBCTL0 */
#define FMC_OBCTL0_OB_LK               BIT(0)                                        /*!< FMC_OBCTL0 lock bit */
#define FMC_OBCTL0_OB_START            BIT(1)                                        /*!< send option byte change command to FMC bit */
#define FMC_OBCTL0_SPC                 BITS(8,15)                                    /*!< option bytes security protection code */

/* FMC_OBCTL1 */
#define FMC_OBCTL1_OBERR               BIT(0)                                        /*!< option bytes read error bit */
#define FMC_OBCTL1_NWDG_HW             BIT(2)                                        /*!< option byte watchdog value */
#define FMC_OBCTL1_NRST_DPSLP          BIT(3)                                        /*!< option byte deepsleep reset value */
#define FMC_OBCTL1_NRST_STDBY          BIT(4)                                        /*!< option byte standby reset value */
#define FMC_OBCTL1_SRAM_RST            BIT(5)                                        /*!< option byte sram initialize value */
#define FMC_OBCTL1_ECC_EN              BIT(6)                                        /*!< option byte sram ecc enable/disable */
#define FMC_OBCTL1_NWLD_SEL            BITS(7,8)                                     /*!< select the clock for loading no waiting time area. */
#define FMC_OBCTL1_DATA                BITS(10,25)                                   /*!< store DATA of option bytes block after system reset */

/* FMC_OBCTL2 */
#define FMC_OBCTL2_WP                  BITS(0,31)                                    /*!< store WP of option bytes block after system reset */

