wajmh/Code/Firmware/GD32F50x_Firmware_Library/Firmware/GD32F50x_standard_peripheral/Include/gd32f50x_fmc.h
/* FMC_OTP1CFG */
#define FMC_OTP1CFG_OTP1REN            BITS(0,15)                                    /*!< FMC OTP1 read enable bits */

/* FMC_OBSTAT */
#define FMC_OBSTAT_SPCL                BIT(0)                                        /*!< security protection is level low */
#define FMC_OBSTAT_SPCH                BIT(1)                                        /*!< security protection is level high */

/* FMC_KEY1 */
#define FMC_KEY1_KEY                   BITS(0,31)                                    /*!< FMC_CTL1 unlock key bits */

/* FMC_STAT1 */
#define FMC_STAT1_BUSY                 BIT(0)                                        /*!< The flash is busy bit */
#define FMC_STAT1_PGERR                BIT(2)                                        /*!< flash program error flag bit */
#define FMC_STAT1_WPERR                BIT(4)                                        /*!< erase/program protection error flag bit */
#define FMC_STAT1_ENDF                 BIT(5)                                        /*!< end of operation flag bit */

/* FMC_CTL1 */
#define FMC_CTL1_PG                    BIT(0)                                        /*!< main flash program for bank1 command bit */
#define FMC_CTL1_PER                   BIT(1)                                        /*!< main flash page erase for bank1 command bit */
#define FMC_CTL1_MER                   BIT(2)                                        /*!< main flash mass erase for bank1 command bit */
#define FMC_CTL1_START                 BIT(6)                                        /*!< send erase command to FMC bit */
#define FMC_CTL1_LK                    BIT(7)                                        /*!< FMC_CTL1 lock bit */
#define FMC_CTL1_ERRIE                 BIT(10)                                       /*!< error interrupt enable bit */
#define FMC_CTL1_ENDIE                 BIT(12)                                       /*!< end of operation interrupt enable bit */

/* FMC_ADDR1 */
#define FMC_ADDR1_ADDR                 BITS(0,31)                                    /*!< Flash erase/program command address bits */

/* FMC_OTP3_STAT */
#define FMC_OTP3_STAT_NDBG             BIT(0)                                        /*!< debugging permission setting bit */
#define FMC_OTP3_STAT_NBTSB            BIT(1)                                        /*!< not boot from SRAM or bootloader */
#define FMC_OTP3_STAT_BTFOSEL          BIT(2)                                        /*!< select Boot from flash or OTP1 */
#define FMC_OTP3_STAT_NDBG_LK          BIT(4)                                        /*!< NDBG lock status */
#define FMC_OTP3_STAT_NBTSB_LK         BIT(5)                                        /*!< NBTSB lock status */
#define FMC_OTP3_STAT_BTFOSEL_LK       BIT(6)                                        /*!< BTFOSEL lock status */

/* FMC_PID */
#define FMC_PID_PID                    BITS(0,31)                                    /*!< product ID bits */

/* constants definitions */
/* unlock key */
#define UNLOCK_KEY0                    ((uint32_t)0x45670123U)                       /*!< unlock key 0 */
#define UNLOCK_KEY1                    ((uint32_t)0xCDEF89ABU)                       /*!< unlock key 1 */

/* read protect configure */
#define OBCTL0_SPC(regval)             (BITS(8,15) & ((uint32_t)(regval) << 8))
#define FMC_NSPC                       OBCTL0_SPC(0xAA)                              /*!< no security protection */
#define FMC_LSPC                       OBCTL0_SPC(0xBB)                              /*!< low security protection */
#define FMC_HSPC                       OBCTL0_SPC(0xCC)                              /*!< high security protection */

/* option byte software/hardware free watch dog timer */
#define OB_FWDGT_SW                    FMC_OBCTL1_NWDG_HW                            /*!< software free watchdog */
#define OB_FWDGT_HW                    ((uint32_t)0x00000000U)                       /*!< hardware free watchdog */

/* option byte reset or not entering deep sleep mode */
#define OB_DEEPSLEEP_NRST              FMC_OBCTL1_NRST_DPSLP                         /*!< no reset when entering deepsleep mode */
#define OB_DEEPSLEEP_RST               ((uint32_t)0x00000000U)                       /*!< generate a reset instead of entering deepsleep mode */

/* option byte reset or not entering standby mode */
#define OB_STDBY_NRST                  FMC_OBCTL1_NRST_STDBY                         /*!< no reset when entering standby mode */
#define OB_STDBY_RST                   ((uint32_t)0x00000000U)                       /*!< generate a reset instead of entering standby mode */

/* option byte sram initialize value */
#define OB_SRAM_INI_DISABLE            FMC_OBCTL1_SRAM_RST                           /*!< do not initialize SRAM after power reset */
#define OB_SRAM_INI_ENABLE             ((uint32_t)0x00000000U)                       /*!< initialize SRAM after power reset */

/* option byte sram ecc function value */
#define OB_SRAMECC_ENABLE              FMC_OBCTL1_ECC_EN                             /*!< SRAM ECC enable */
#define OB_SRAMECC_DISABLE             ((uint32_t)0x00000000U)                       /*!< SRAM ECC disable */

/* option byte NWLD_CLK value */
#define OBCTL1_NWLD_SEL(regval)        (BITS(7,8) & ((uint32_t)(regval) << 7))
#define PLL_CLK_200M                   OBCTL1_NWLD_SEL(0)                           /*!< select 200M from PLL */
#define PLL_CLK_160M                   OBCTL1_NWLD_SEL(1)                           /*!< select 160M from PLL */
#define PLL_CLK_120M                   OBCTL1_NWLD_SEL(2)                           /*!< select 120M from PLL */
#define IRC8M_CLK_8M                   OBCTL1_NWLD_SEL(3)                           /*!< select 8M from IRC8M */

/* option bytes write protection */
#define OB_WP_0                        BIT(0)                                        /*!< erase/program protection of page 0,1  */
#define OB_WP_1                        BIT(1)                                        /*!< erase/program protection of page 2,3  */
#define OB_WP_2                        BIT(2)                                        /*!< erase/program protection of page 4,5  */
#define OB_WP_3                        BIT(3)                                        /*!< erase/program protection of page 6,7  */
#define OB_WP_4                        BIT(4)                                        /*!< erase/program protection of page 8,9  */
#define OB_WP_5                        BIT(5)                                        /*!< erase/program protection of page 10,11 */
#define OB_WP_6                        BIT(6)                                        /*!< erase/program protection of page 12,13 */
#define OB_WP_7                        BIT(7)                                        /*!< erase/program protection of page 14,15 */
#define OB_WP_8                        BIT(8)                                        /*!< erase/program protection of page 16,17 */
#define OB_WP_9                        BIT(9)                                        /*!< erase/program protection of page 18,19 */
#define OB_WP_10                       BIT(10)                                       /*!< erase/program protection of page 20,21 */
#define OB_WP_11                       BIT(11)                                       /*!< erase/program protection of page 22,23 */
#define OB_WP_12                       BIT(12)                                       /*!< erase/program protection of page 24,25 */
#define OB_WP_13                       BIT(13)                                       /*!< erase/program protection of page 26,27 */
#define OB_WP_14                       BIT(14)                                       /*!< erase/program protection of page 28,29 */
#define OB_WP_15                       BIT(15)                                       /*!< erase/program protection of page 30,31 */
#define OB_WP_16                       BIT(16)                                       /*!< erase/program protection of page 32,33 */
#define OB_WP_17                       BIT(17)                                       /*!< erase/program protection of page 34,35 */
#define OB_WP_18                       BIT(18)                                       /*!< erase/program protection of page 36,37 */
#define OB_WP_19                       BIT(19)                                       /*!< erase/program protection of page 38,39 */
#define OB_WP_20                       BIT(20)                                       /*!< erase/program protection of page 40,41 */
#define OB_WP_21                       BIT(21)                                       /*!< erase/program protection of page 42,43 */
#define OB_WP_22                       BIT(22)                                       /*!< erase/program protection of page 44,45 */
#define OB_WP_23                       BIT(23)                                       /*!< erase/program protection of page 46,47 */
#define OB_WP_24                       BIT(24)                                       /*!< erase/program protection of page 48,49 */
#define OB_WP_25                       BIT(25)                                       /*!< erase/program protection of page 50,51 */
#define OB_WP_26                       BIT(26)                                       /*!< erase/program protection of page 52,53 */
#define OB_WP_27                       BIT(27)                                       /*!< erase/program protection of page 54,55 */
#define OB_WP_28                       BIT(28)                                       /*!< erase/program protection of page 56,57 */
#define OB_WP_29                       BIT(29)                                       /*!< erase/program protection of page 58,59 */
#define OB_WP_30                       BIT(30)                                       /*!< erase/program protection of page 60,61 */
#define OB_WP_31                       BIT(31)                                       /*!< erase/program protection of page 62-383 */
#define OB_WP_ALL                      BITS(0,31)                                    /*!< erase/program protection of all pages */

/* OTP1 data block read enable */
#define OTP1_DATA_BLOCK_0              BIT(0)                                        /*!< OTP1 read enable of data block 0  */
#define OTP1_DATA_BLOCK_1              BIT(1)                                        /*!< OTP1 read enable of data block 1  */
#define OTP1_DATA_BLOCK_2              BIT(2)                                        /*!< OTP1 read enable of data block 2  */
#define OTP1_DATA_BLOCK_3              BIT(3)                                        /*!< OTP1 read enable of data block 3  */
#define OTP1_DATA_BLOCK_4              BIT(4)                                        /*!< OTP1 read enable of data block 4  */
#define OTP1_DATA_BLOCK_5              BIT(5)                                        /*!< OTP1 read enable of data block 5  */
#define OTP1_DATA_BLOCK_6              BIT(6)                                        /*!< OTP1 read enable of data block 6  */
#define OTP1_DATA_BLOCK_7              BIT(7)                                        /*!< OTP1 read enable of data block 7  */
#define OTP1_DATA_BLOCK_8              BIT(8)                                        /*!< OTP1 read enable of data block 8  */
#define OTP1_DATA_BLOCK_9              BIT(9)                                        /*!< OTP1 read enable of data block 9  */
#define OTP1_DATA_BLOCK_10             BIT(10)                                       /*!< OTP1 read enable of data block 10 */
#define OTP1_DATA_BLOCK_11             BIT(11)                                       /*!< OTP1 read enable of data block 11 */
#define OTP1_DATA_BLOCK_12             BIT(12)                                       /*!< OTP1 read enable of data block 12 */
#define OTP1_DATA_BLOCK_13             BIT(13)                                       /*!< OTP1 read enable of data block 13 */
#define OTP1_DATA_BLOCK_14             BIT(14)                                       /*!< OTP1 read enable of data block 14 */
#define OTP1_DATA_BLOCK_15             BIT(15)                                       /*!< OTP1 read enable of data block 15 */
#define OTP1_DATA_BLOCK_ALL            BITS(0,15)                                    /*!< OTP1 read enable of ALL data blocks */

/* OTP0 address */
#define OTP0_DATA_BLOCK_BASE_ADDRESS   ((uint32_t)0x1FFF7800U)                       /*!< OTP0 data block base address */
#define OTP0_DATA_BLOCK_END_ADDRESS    ((uint32_t)0x1FFF783FU)                       /*!< OTP0 data block end address */
#define OTP0_LOCK_BLOCK_BASE_ADDRESS   ((uint32_t)0x1FFF7840U)                       /*!< OTP0 lock block base address */
#define OTP0_LOCK_BLOCK_END_ADDRESS    ((uint32_t)0x1FFF787FU)                       /*!< OTP0 lock block end address */

