wajmh/Code/Firmware/GD32F50x_Firmware_Library/Firmware/GD32F50x_standard_peripheral/Include/gd32f50x_fmc.h
/* OTP1 address */
#define OTP1_DATA_BLOCK_BASE_ADDRESS   ((uint32_t)0x1FF00000U)                       /*!< OTP1 data block base address */
#define OTP1_DATA_BLOCK_END_ADDRESS    ((uint32_t)0x1FF1FFFFU)                       /*!< OTP1 data block end address */
#define OTP1_LOCK_BLOCK_BASE_ADDRESS   ((uint32_t)0x1FF20100U)                       /*!< OTP1 lock block base address */
#define OTP1_LOCK_BLOCK_END_ADDRESS    ((uint32_t)0x1FF2010FU)                       /*!< OTP1 lock block end address */

/* OTP2 address */
#define OTP2_DATA_BLOCK_BASE_ADDRESS   ((uint32_t)0x1FF20000U)                       /*!< OTP2 data block base address */
#define OTP2_DATA_BLOCK_END_ADDRESS    ((uint32_t)0x1FF200FFU)                       /*!< OTP2 data block end address */
#define OTP2_WLOCK_BLOCK_BASE_ADDRESS  ((uint32_t)0x1FF20110U)                       /*!< OTP2 write lock block base address */
#define OTP2_WLOCK_BLOCK_END_ADDRESS   ((uint32_t)0x1FF2014FU)                       /*!< OTP2 write lock block end address */
#define OTP2_RLOCK_BLOCK_BASE_ADDRESS  ((uint32_t)0x1FF20150U)                       /*!< OTP2 read lock block base address */
#define OTP2_RLOCK_BLOCK_END_ADDRESS   ((uint32_t)0x1FF2018FU)                       /*!< OTP2 read lock block end address */

/* OTP3 address */
#define OTP3_DATA_BLOCK_BASE_ADDRESS   ((uint32_t)0x1FFF7900U)                       /*!< OTP3 data block base address */
#define OTP3_DATA_BLOCK_END_ADDRESS    ((uint32_t)0x1FFF7923U)                       /*!< OTP3 data block end address */
#define OTP3_LOCK_BLOCK_BASE_ADDRESS   ((uint32_t)0x1FFF7930U)                       /*!< OTP3 lock block base address */
#define OTP3_LOCK_BLOCK_END_ADDRESS    ((uint32_t)0x1FFF793BU)                       /*!< OTP3 lock block end address */

/* define the FMC bit position and its register index offset */
#define FMC_REGIDX_BIT(regidx, bitpos)              (((uint32_t)(regidx) << 6) | (uint32_t)(bitpos))
#define FMC_REG_VAL(offset)                         (REG32(FMC + ((uint32_t)(offset) >> 6)))
#define FMC_BIT_POS(val)                            ((uint32_t)(val) & 0x1FU)
#define FMC_REGIDX_BITS(regidx, bitpos0, bitpos1)   (((uint32_t)(regidx) << 12) | ((uint32_t)(bitpos0) << 6) | (uint32_t)(bitpos1))
#define FMC_REG_VALS(offset)                        (REG32(FMC + ((uint32_t)(offset) >> 12)))
#define FMC_BIT_POS0(val)                           (((uint32_t)(val) >> 6) & 0x1FU)
#define FMC_BIT_POS1(val)                           ((uint32_t)(val) & 0x1FU)
#define FMC_REG_OFFSET_GET(flag)                    ((uint32_t)(flag) >> 12)

/* configuration register */
#define FMC_STAT0_REG_OFFSET                        0x0CU                            /*!< status register 0 offset */
#define FMC_CTL0_REG_OFFSET                         0x10U                            /*!< control register 0 offset */
#define FMC_STAT1_REG_OFFSET                        0x4CU                            /*!< status register 1 offset */
#define FMC_CTL1_REG_OFFSET                         0x50U                            /*!< control register 1 offset */
#define FMC_OBCTL1_REG_OFFSET                       0x1CU                            /*!< option byte status register offset */

/* fmc state */
typedef enum {
    FMC_READY,                                                                       /*!< the operation has been completed */
    FMC_BUSY,                                                                        /*!< the operation is in progress */
    FMC_PGERR,                                                                       /*!< program error */
    FMC_WPERR,                                                                       /*!< erase/program protection error */
    FMC_TOERR,                                                                       /*!< timeout error */
} fmc_state_enum;

/* FMC interrupt enable */
typedef enum {
    FMC_INT_BANK0_END     = FMC_REGIDX_BIT(FMC_CTL0_REG_OFFSET, 12U),                /*!< FMC bank0 end of operation */
    FMC_INT_BANK0_ERR     = FMC_REGIDX_BIT(FMC_CTL0_REG_OFFSET, 10U),                /*!< FMC bank0 error */
    FMC_INT_BANK1_END     = FMC_REGIDX_BIT(FMC_CTL1_REG_OFFSET, 12U),                /*!< FMC bank1 end of operation */
    FMC_INT_BANK1_ERR     = FMC_REGIDX_BIT(FMC_CTL1_REG_OFFSET, 10U),                /*!< FMC bank1 error */
} fmc_interrupt_enum;

/* FMC flags */
typedef enum {
    FMC_FLAG_BANK0_BUSY   = FMC_REGIDX_BIT(FMC_STAT0_REG_OFFSET, 0U),                /*!< FMC bank0 busy flag */
    FMC_FLAG_BANK0_PGERR  = FMC_REGIDX_BIT(FMC_STAT0_REG_OFFSET, 2U),                /*!< FMC bank0 operation error flag bit */
    FMC_FLAG_BANK0_WPERR  = FMC_REGIDX_BIT(FMC_STAT0_REG_OFFSET, 4U),                /*!< FMC bank0 erase/program protection error flag bit */
    FMC_FLAG_BANK0_END    = FMC_REGIDX_BIT(FMC_STAT0_REG_OFFSET, 5U),                /*!< FMC bank0 end of operation flag bit */
    FMC_FLAG_OBERR        = FMC_REGIDX_BIT(FMC_OBCTL1_REG_OFFSET, 0U),               /*!< FMC option bytes read error flag */
    FMC_FLAG_BANK1_BUSY   = FMC_REGIDX_BIT(FMC_STAT1_REG_OFFSET, 0U),                /*!< FMC bank1 busy flag */
    FMC_FLAG_BANK1_PGERR  = FMC_REGIDX_BIT(FMC_STAT1_REG_OFFSET, 2U),                /*!< FMC bank1 operation error flag bit */
    FMC_FLAG_BANK1_WPERR  = FMC_REGIDX_BIT(FMC_STAT1_REG_OFFSET, 4U),                /*!< FMC bank1 erase/program protection error flag bit */
    FMC_FLAG_BANK1_END    = FMC_REGIDX_BIT(FMC_STAT1_REG_OFFSET, 5U),                /*!< FMC bank1 end of operation flag bit */
} fmc_flag_enum;

/* FMC interrupt flags */
typedef enum {
    FMC_INT_FLAG_BANK0_PGERR  = FMC_REGIDX_BITS(FMC_STAT0_REG_OFFSET, 2U, 10U),      /*!< FMC bank0 operation error interrupt flag bit */
    FMC_INT_FLAG_BANK0_WPERR  = FMC_REGIDX_BITS(FMC_STAT0_REG_OFFSET, 4U, 10U),      /*!< FMC bank0 erase/program protection error interrupt flag bit */
    FMC_INT_FLAG_BANK0_END    = FMC_REGIDX_BITS(FMC_STAT0_REG_OFFSET, 5U, 12U),      /*!< FMC bank0 end of operation interrupt flag bit */
    FMC_INT_FLAG_BANK1_PGERR  = FMC_REGIDX_BITS(FMC_STAT1_REG_OFFSET, 2U, 10U),      /*!< FMC bank1 operation error interrupt flag bit */
    FMC_INT_FLAG_BANK1_WPERR  = FMC_REGIDX_BITS(FMC_STAT1_REG_OFFSET, 4U, 10U),      /*!< FMC bank1 erase/program protection error interrupt flag bit */
    FMC_INT_FLAG_BANK1_END    = FMC_REGIDX_BITS(FMC_STAT1_REG_OFFSET, 5U, 12U),      /*!< FMC bank1 end of operation interrupt flag bit */
} fmc_interrupt_flag_enum;

/* FMC timeout */
#define FMC_TIMEOUT_COUNT              ((uint32_t)0x0FFF0000U)                      /*!< FMC timeout count value */

/* FMC BANK address */
#define FMC_SIZE                       REG16(0x1FFFF7E0U)                           /*!< FMC size */
#define FLASH_BASE_ADDRESS             ((uint32_t)0x08000000U)                      /*!< flash base address */
#define FLASH_END_ADDRESS              (FLASH_BASE_ADDRESS + (FMC_SIZE * 0x400U))   /*!< flash end address */
#define FMC_BANK0_END_ADDRESS          ((uint32_t)0x0807FFFFU)                      /*!< FMC bank0 end address */
#define FMC_BANK0_SIZE                 ((uint32_t)0x00000200U)                      /*!< FMC bank0 size */
#define OTP_BASE_ADDRESS               ((uint32_t)0x1FF00000U)                      /*!< OTP base address */
#define OTP_END_ADDRESS                ((uint32_t)0x1FFF7940U)                      /*!< OTP end address */

