wajmh/Code/Firmware/GD32F50x_Firmware_Library/Firmware/GD32F50x_standard_peripheral/Include/gd32f50x_fmc.h
/* parameter check definitions */
#ifdef FW_DEBUG_ERR_REPORT

/* check FMC page valid address */
#define NOT_FMC_PAGE_VALID_ADDRESS(page_address)      (((page_address) >= FLASH_END_ADDRESS) || ((page_address) < FLASH_BASE_ADDRESS))
/* check FMC flash valid word address */
#define NOT_FMC_FLASH_WORD_ADDRESS(address)           (((address) >= FLASH_END_ADDRESS) || ((address) < FLASH_BASE_ADDRESS) || (0U != ((address) & 0x00000003U)))
/* check FMC flash valid halfword address */
#define NOT_FMC_FLASH_HALFWORD_ADDRESS(address)       (((address) >= FLASH_END_ADDRESS) || ((address) < FLASH_BASE_ADDRESS) || (0U != ((address) & 0x00000001U)))
/* check FMC OTP valid byte address */
#define NOT_FMC_OTP_BYTE_ADDRESS(address)             (((address) < OTP_BASE_ADDRESS) || ((address) >= OTP_END_ADDRESS))
/* check FMC OTP valid halfword address */
#define NOT_FMC_OTP_HALFWORD_ADDRESS(address)         ((((address) < OTP_BASE_ADDRESS) || ((address) >= OTP_END_ADDRESS)) || (0U != ((address) & 0x00000001U)))
/* check FMC OTP valid word address */
#define NOT_FMC_OTP_WORD_ADDRESS(address)             ((((address) < OTP_BASE_ADDRESS) || ((address) >= OTP_END_ADDRESS)) || (0U != ((address) & 0x00000003U)))
/* check FMC OB_WP value */
#define NOT_FMC_OB_WP(ob_wp)                          (0U != (((ob_wp) & 0x7FFFFFFFU) >> (FMC_SIZE /0x10U)))

#endif /* FW_DEBUG_ERR_REPORT */

/* function declarations */
/* FMC main memory programming functions */
/* unlock the main FMC operation */
void fmc_unlock(void);
/* unlock the FMC bank0 operation */
void fmc_bank0_unlock(void);
/* unlock the FMC bank1 operation */
void fmc_bank1_unlock(void);
/* lock the main FMC operation */
void fmc_lock(void);
/* lock the FMC bank0 operation */
void fmc_bank0_lock(void);
/* lock the FMC bank1 operation */
void fmc_bank1_lock(void);
/* erase page */
fmc_state_enum fmc_page_erase(uint32_t page_address);
/* erase whole chip */
fmc_state_enum fmc_mass_erase(void);
/* erase bank0 */
fmc_state_enum fmc_bank0_erase(void);
/* erase bank1 */
fmc_state_enum fmc_bank1_erase(void);
/* program a word at the corresponding address */
fmc_state_enum fmc_word_program(uint32_t address, uint32_t data);
/* program a half word at the corresponding address */
fmc_state_enum fmc_halfword_program(uint32_t address, uint16_t data);

/* program a word at the OTP address */
fmc_state_enum fmc_otp_word_program(uint32_t address, uint32_t data);
/* program a half word at the OTP address */
fmc_state_enum fmc_otp_half_word_program(uint32_t address, uint16_t data);
/* program a byte at the OTP address */
fmc_state_enum fmc_otp_byte_program(uint32_t address, uint8_t data);

/* enable no waiting time area load after system reset */
void fmc_nwa_enable(void);
/* disable no waiting time area load after system reset */
void fmc_nwa_disable(void);
/* set OTP1 data block not be read */
void otp1_read_disable(uint32_t block);
/* enable read lock block protection for OTP2 */
void otp2_rlock_enable(void);
/* enable deep power down mode when no operation */
void fmc_deep_power_down_enable(void);
/* disable deep power down mode when no operation */
void fmc_deep_power_down_disable(void);

/* FMC option bytes programming functions */
/* unlock the option byte operation */
void ob_unlock(void);
/* lock the option byte operation */
void ob_lock(void);
/* send option byte change command */
void ob_start(void);
/* erase the option byte */
void ob_erase(void);
/* enable write protection */
ErrStatus ob_write_protection_enable(uint32_t ob_wp);
/* disable write protection */
ErrStatus ob_write_protection_disable(uint32_t ob_wp);
/* configure security protection level */
void ob_security_protection_config(uint32_t ob_spc);
/* program the FMC user option byte */
void ob_user_write(uint32_t ob_fwdgt, uint32_t ob_deepsleep, uint32_t ob_stdby);
/* configure the option byte sram initialize value */
void ob_sram_init_config(uint32_t init_mode);
/* configure the option byte sram ecc enable value */
void ob_sram_ecc_config(uint32_t ecc_mode);
/* configure the option byte the clock for loading no waiting time area */
void ob_nwa_clock_config(uint32_t clock_mode);
/* program option bytes data */
void ob_data_write(uint16_t data);
/* get the option byte sram initialize value */
uint32_t ob_sram_init_get(void);
/* get the option byte sram ecc enable value */
uint32_t ob_sram_ecc_get(void);
/* get the option byte the clock for loading no waiting time area */
uint32_t ob_nwa_clock_get(void);
/* get the FMC data option byte */
uint16_t ob_data_get(void);
/* get the FMC option byte write protection */
uint32_t ob_write_protection_get(void);
/* get option byte security protection code value */
uint32_t ob_spc_get(void);

/* FMC interrupts and flags management functions */
/* check flag is set or not */
FlagStatus fmc_flag_get(fmc_flag_enum flag);
/* clear the FMC flag */
void fmc_flag_clear(fmc_flag_enum flag);
/* enable FMC interrupt */
void fmc_interrupt_enable(fmc_interrupt_enum interrupt);
/* disable FMC interrupt */
void fmc_interrupt_disable(fmc_interrupt_enum interrupt);
/* get FMC interrupt flag state */
FlagStatus fmc_interrupt_flag_get(fmc_interrupt_flag_enum flag);
/* clear FMC interrupt flag state */
void fmc_interrupt_flag_clear(fmc_interrupt_flag_enum flag);

/* get the FMC bank0 state */
fmc_state_enum fmc_bank0_state_get(void);
/* get the FMC bank1 state */
fmc_state_enum fmc_bank1_state_get(void);
/* check whether FMC bank0 is ready or not */
fmc_state_enum fmc_bank0_ready_wait(uint32_t timeout);
/* check whether FMC bank1 is ready or not */
fmc_state_enum fmc_bank1_ready_wait(uint32_t timeout);

#endif /* GD32F50X_FMC_H */
